Конфигурация/Catalogs/СтраныМира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтраныМира</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/СтраныМира/Ext/ManagerModule.bsl
// Обновить справочник стран мира согласно данным из макета Справочники.СтраныМира.Макеты.Классификатор.
// Идентификация существующих элементов в справочнике выполняется по полю Код.
//
Процедура ЗагрузитьСтраныМираИзКлассификатора() Экспорт
	
	// Получим список уже загруженных стран
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныМира.Код КАК Код,
		|	СтраныМира.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|
		|	УПОРЯДОЧИТЬ ПО Код";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Макет 				= Справочники.СтраныМира.ПолучитьМакет("Классификатор");
	ТаблицаСтран 		= РаботаСКоллекциями.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст()).Данные;
	СтруктураЭлемента 	= Новый Структура;
	
	Для Каждого ТекущаяСтрана Из ТаблицаСтран Цикл
		НайденныйЭлемент = РезультатЗапроса.Найти(ТекущаяСтрана.Code, "Код");
		
		Если НайденныйЭлемент = Неопределено Тогда
			Элемент 					= Справочники.СтраныМира.СоздатьЭлемент();
			Элемент.Код					= ТекущаяСтрана.Code;
			Элемент.Наименование		= ТекущаяСтрана.ShortName;
			Элемент.КодАльфа2			= ТекущаяСтрана.Alpha2;
			Элемент.КодАльфа3			= ТекущаяСтрана.Alpha3;
			Элемент.НаименованиеПолное 	= ТекущаяСтрана.FullName;
			Элемент.Записать();

			Продолжить;
			
		КонецЕсли;
		
		Элемент 			= НайденныйЭлемент.Ссылка;
		Поля 				= "";
		Если Элемент.Код <> ТекущаяСтрана.Code Тогда 
			СтруктураЭлемента.Вставить("Код", ТекущаяСтрана.Code);
			Поля = Поля + "%Поле%,"; 
			Поля = СтрЗаменить(Поля, "%Поле%", "Код");
		КонецЕсли;
		Если Элемент.Наименование <> ТекущаяСтрана.ShortName Тогда 
			СтруктураЭлемента.Вставить("Наименование", ТекущаяСтрана.ShortName);
			Поля = Поля + "%Поле%,";
			Поля = СтрЗаменить(Поля, "%Поле%", "Наименование");
		КонецЕсли;
		Если Элемент.КодАльфа2 <> ТекущаяСтрана.Alpha2 Тогда 
			СтруктураЭлемента.Вставить("КодАльфа2", ТекущаяСтрана.Alpha2);
			Поля = Поля + "%Поле%,";
			Поля = СтрЗаменить(Поля, "%Поле%", "КодАльфа2");
		КонецЕсли;
		Если Элемент.КодАльфа3 <> ТекущаяСтрана.Alpha3 Тогда 
			СтруктураЭлемента.Вставить("КодАльфа3", ТекущаяСтрана.Alpha3);
			Поля = Поля + "%Поле%,";
			Поля = СтрЗаменить(Поля, "%Поле%", "КодАльфа3");
		КонецЕсли;
		Если Элемент.НаименованиеПолное <> ТекущаяСтрана.FullName Тогда 
			СтруктураЭлемента.Вставить("НаименованиеПолное", ТекущаяСтрана.FullName);
			Поля = Поля + "%Поле%,";
			Поля = СтрЗаменить(Поля, "%Поле%", "НаименованиеПолное");
		КонецЕсли;
		
		Если СтруктураЭлемента.Количество() > 0 Тогда 
			ДлинаСтроки 	= СтрДлина(Поля);
			Поля 			= Лев(Поля, ДлинаСтроки - 1);
			СтранаОбъект 	= Элемент.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СтранаОбъект, СтруктураЭлемента, Поля);
			СтранаОбъект.Записать();
		КонецЕсли;	
		
		СтруктураЭлемента.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры
